In [1]:
import pandas as pd

In [20]:
events = pd.read_csv("events_ful.csv", header=None)
events.drop(5, axis=1, inplace=True)
events.columns = ['account', 'action', 'date', 'source', 'details', 'event', 'churn']
events.head()

    account    action        date source    details    event  churn
0  150-3302  order:UP  2012-03-05   user  Order: UP  2859969      0
1  150-3302  order:DW  2011-07-19   user  Order: DW  2859970      0
2  150-3302  order:IN  2011-05-04   user  Order: IN  2859971      0
3  150-3302  order:NP  2015-07-01   user  Order: NP  2859972      0
4  150-3302  order:UP  2013-08-20   user  Order: UP  2859973      0

In [3]:
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 650734 entries, 0 to 650733
Data columns (total 7 columns):
account    650734 non-null object
action     650734 non-null object
date       650734 non-null object
source     650734 non-null object
details    650734 non-null object
event      650734 non-null int64
churn      650734 non-null int64
dtypes: int64(2), object(5)
memory usage: 34.8+ MB

In [6]:
binary = pd.get_dummies(events.action)
binary.head()

,Call:Add Services,Call:Adding Wifi Device,Call:Balance Question,Call:Bill Looks Different,Call:Bill Question,Call:Change Info,Call:Check on Status,Call:Checking on shipment,Call:Downgrade,Call:Email Issues,...,transaction_change:R:-:high,transaction_change:R:-:low,transaction_change:R:-:medium,transaction_change:U:+:extreme,transaction_change:U:+:high,transaction_change:U:+:low,transaction_change:U:+:medium,transaction_change:U:-:high,transaction_change:U:-:low,transaction_change:U:-:medium
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [9]:
events.account.value_counts()

400-30269601     325
400-58046101     287
106-431505908    275
400-56087902     262
106-600100201    261
400-614165406    249
106-431567804    244
400-53002303     244
106-240618809    243
400-32047801     236
400-612810901    227
400-29986402     222
106-240352305    221
106-110774802    219
150-88703602     217
400-22578201     213
150-48882607     211
400-22538701     209
400-22487304     209
400-17658901     208
106-260096601    205
400-21790102     204
106-240933504    203
400-44390501     203
400-17604801     203
811-610147902    202
400-19799101     201
400-46370602     198
400-42674202     198
811-612800001    198
                ...
150-49138903       3
150-114079408      3
150-69563107       3
150-118673101      3
150-100903407      3
150-49519714       3
150-110327517      3
150-53981413       3
150-111257602      3
150-110419306      3
150-87360405       3
150-114040911      3
150-119944802      3
150-55551513       3
150-244707004      3
150-10897619       3
150-8507102        2
150-89666811       2
811-623817202      2
150-118545906      2
150-537811         2
150-7584319        2
150-69159717       2
106-281054708      2
150-9535007        2
150-82310812       2
150-47863122       2
150-46623323       2
150-8696206        2
400-28462602       1
Name: account, dtype: int64

In [10]:
one_acc = events[events.account == '400-30269601']
one_acc.head()

,account,action,date,source,details,event,churn
68398,400-30269601,rate_changes,2014-10-27,system,Rate change from 45.0 to 65.0 service: HSDBASE,2933565,0
68399,400-30269601,rate_changes,2014-10-27,system,Rate change from 48.0 to 45.0 service: SP05000,2933566,0
68400,400-30269601,peak:P:+,2015-02-10,system,Abrupt change: 190.0,2933567,0
68401,400-30269601,peak:R:-,2014-12-21,system,Abrupt change: 155.09,2933571,0
68402,400-30269601,peak:R:+,2015-08-21,system,Abrupt change: 177.16,2933572,0

In [15]:
one_acc[one_acc.source == 'user'].action.value_counts()

order:NP              139
order:DW               41
order:UP               33
order:TC               20
order:SR                3
Call:Bill Question      2
order:IN                1
order:DI                1
Call:Make Payment       1
Name: action, dtype: int64

In [21]:
site_id = events.account.apply(lambda x : str(x).split('-')[0])
events.insert(0, 'site_id', site_id)
events.head()

  site_id   account    action        date source    details    event  churn
0     150  150-3302  order:UP  2012-03-05   user  Order: UP  2859969      0
1     150  150-3302  order:DW  2011-07-19   user  Order: DW  2859970      0
2     150  150-3302  order:IN  2011-05-04   user  Order: IN  2859971      0
3     150  150-3302  order:NP  2015-07-01   user  Order: NP  2859972      0
4     150  150-3302  order:UP  2013-08-20   user  Order: UP  2859973      0

In [22]:
events.account = events.account.apply(lambda x: str(x).split('-')[1])
events.head()

  site_id account    action        date source    details    event  churn
0     150    3302  order:UP  2012-03-05   user  Order: UP  2859969      0
1     150    3302  order:DW  2011-07-19   user  Order: DW  2859970      0
2     150    3302  order:IN  2011-05-04   user  Order: IN  2859971      0
3     150    3302  order:NP  2015-07-01   user  Order: NP  2859972      0
4     150    3302  order:UP  2013-08-20   user  Order: UP  2859973      0

In [23]:
simpler = events.drop(['details', 'event'], axis=1)
simpler.head()

  site_id account    action        date source  churn
0     150    3302  order:UP  2012-03-05   user      0
1     150    3302  order:DW  2011-07-19   user      0
2     150    3302  order:IN  2011-05-04   user      0
3     150    3302  order:NP  2015-07-01   user      0
4     150    3302  order:UP  2013-08-20   user      0

In [28]:
orders = simpler[simpler.action.apply(lambda x : True if 'order' in str(x) else False)]
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234025 entries, 0 to 501548
Data columns (total 6 columns):
site_id    234025 non-null object
account    234025 non-null object
action     234025 non-null object
date       234025 non-null object
source     234025 non-null object
churn      234025 non-null int64
dtypes: int64(1), object(5)
memory usage: 12.5+ MB

In [29]:
orders.head()

  site_id account    action        date source  churn
0     150    3302  order:UP  2012-03-05   user      0
1     150    3302  order:DW  2011-07-19   user      0
2     150    3302  order:IN  2011-05-04   user      0
3     150    3302  order:NP  2015-07-01   user      0
4     150    3302  order:UP  2013-08-20   user      0

In [34]:
orders.columns = ['site_id', 'account', 'order_action', 'date', 'source', 'churn']
orders.head()

  site_id account order_action        date source  churn
0     150    3302     order:UP  2012-03-05   user      0
1     150    3302     order:DW  2011-07-19   user      0
2     150    3302     order:IN  2011-05-04   user      0
3     150    3302     order:NP  2015-07-01   user      0
4     150    3302     order:UP  2013-08-20   user      0

In [35]:
orders.order_action = orders.order_action.apply(lambda x : str(x).split(':')[1])
orders.head()

  site_id account order_action        date source  churn
0     150    3302           UP  2012-03-05   user      0
1     150    3302           DW  2011-07-19   user      0
2     150    3302           IN  2011-05-04   user      0
3     150    3302           NP  2015-07-01   user      0
4     150    3302           UP  2013-08-20   user      0

In [37]:
orders.to_csv("orders.csv")

In [48]:
promos = events[events.action.apply(lambda x : True if 'promo' in str(x) else False)]
promos = promos.drop('event', axis=1)
promos.action = promos.action.apply(lambda x : str(x).split('_')[1])
promos.head()

,site_id,account,action,date,source,details,churn
21,106,22403,starts,2015-01-13,system,Promo: HSDBASE ZRINT2P14,0
22,106,22403,ends,2039-12-31,system,Promo: HSDBASE ZRINT2P14,0
23,106,22403,starts,2015-01-13,system,Promo: SP05000 ZRINT2P14,0
24,106,22403,ends,2039-12-31,system,Promo: SP05000 ZRINT2P14,0
25,106,22403,starts,2015-01-13,system,Promo: 30480 ZRINT2P14,0

In [49]:
start_date = promos[promos.action == 'starts'].date
end_date = promos[promos.action == 'ends'].date
promo = promos.details.apply(lambda x : str(x).split(':')[1].strip())
promos.insert(2, 'promo', promo)
promos.insert(5, 'start_date', start_date)
promos.insert(7, 'end_date', end_date)
promos.head()

,site_id,account,promo,action,date,start_date,source,end_date,details,churn
21,106,22403,HSDBASE ZRINT2P14,starts,2015-01-13,2015-01-13,system,NaN,Promo: HSDBASE ZRINT2P14,0
22,106,22403,HSDBASE ZRINT2P14,ends,2039-12-31,NaN,system,2039-12-31,Promo: HSDBASE ZRINT2P14,0
23,106,22403,SP05000 ZRINT2P14,starts,2015-01-13,2015-01-13,system,NaN,Promo: SP05000 ZRINT2P14,0
24,106,22403,SP05000 ZRINT2P14,ends,2039-12-31,NaN,system,2039-12-31,Promo: SP05000 ZRINT2P14,0
25,106,22403,30480 ZRINT2P14,starts,2015-01-13,2015-01-13,system,NaN,Promo: 30480 ZRINT2P14,0

In [50]:
promos.end_date.fillna(method='backfill', inplace=True)
promos.head()

,site_id,account,promo,action,date,start_date,source,end_date,details,churn
21,106,22403,HSDBASE ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: HSDBASE ZRINT2P14,0
22,106,22403,HSDBASE ZRINT2P14,ends,2039-12-31,NaN,system,2039-12-31,Promo: HSDBASE ZRINT2P14,0
23,106,22403,SP05000 ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: SP05000 ZRINT2P14,0
24,106,22403,SP05000 ZRINT2P14,ends,2039-12-31,NaN,system,2039-12-31,Promo: SP05000 ZRINT2P14,0
25,106,22403,30480 ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: 30480 ZRINT2P14,0

In [52]:
promos.dropna(inplace=True)
promos.head()

,site_id,account,promo,action,date,start_date,source,end_date,details,churn
21,106,22403,HSDBASE ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: HSDBASE ZRINT2P14,0
23,106,22403,SP05000 ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: SP05000 ZRINT2P14,0
25,106,22403,30480 ZRINT2P14,starts,2015-01-13,2015-01-13,system,2039-12-31,Promo: 30480 ZRINT2P14,0
27,106,22403,6686 TIVO13,starts,2013-04-05,2013-04-05,system,2039-12-31,Promo: 6686 TIVO13,0
29,106,22403,325 VID3P13,starts,2013-04-05,2013-04-05,system,2039-12-31,Promo: 325 VID3P13,0

In [54]:
promos.drop(['action', 'details'], axis=1, inplace=True)
promos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 90305 entries, 21 to 501538
Data columns (total 8 columns):
site_id       90305 non-null object
account       90305 non-null object
promo         90305 non-null object
date          90305 non-null object
start_date    90305 non-null object
source        90305 non-null object
end_date      90305 non-null object
churn         90305 non-null int64
dtypes: int64(1), object(7)
memory usage: 6.2+ MB

In [55]:
promos.drop('date', axis=1, inplace=True)
promos.head()

   site_id account              promo  start_date  source    end_date  churn
21     106   22403  HSDBASE ZRINT2P14  2015-01-13  system  2039-12-31      0
23     106   22403  SP05000 ZRINT2P14  2015-01-13  system  2039-12-31      0
25     106   22403    30480 ZRINT2P14  2015-01-13  system  2039-12-31      0
27     106   22403        6686 TIVO13  2013-04-05  system  2039-12-31      0
29     106   22403        325 VID3P13  2013-04-05  system  2039-12-31      0

In [56]:
promos.insert(4, 'end_dat', promos.end_date)
promos.drop('end_date', axis=1, inplace=True)
promos.columns = ['site_id', 'account_id', 'promo', 'start_date', 'end_date', 'source', 'churn']
promos.head()

,site_id,account_id,promo,start_date,end_date,source,churn
21,106,22403,HSDBASE ZRINT2P14,2015-01-13,2039-12-31,system,0
23,106,22403,SP05000 ZRINT2P14,2015-01-13,2039-12-31,system,0
25,106,22403,30480 ZRINT2P14,2015-01-13,2039-12-31,system,0
27,106,22403,6686 TIVO13,2013-04-05,2039-12-31,system,0
29,106,22403,325 VID3P13,2013-04-05,2039-12-31,system,0

In [57]:
promos.to_csv("promos.csv")

In [58]:
calls = simpler[simpler.action.apply(lambda x : True if 'Call' in str(x) else False)]
calls.action = calls.action.apply(lambda x: str(x).split(':')[1].strip())
calls.head()

    site_id account                     action        date source  churn
7       150    3302           Balance Question  2015-09-21   user      0
66      106   22403  TV Channel Problem/Tiling  2015-02-14   user      0
88      106   32501              Where is Tech  2015-02-13   user      0
115     106   76201               Make Payment  2015-06-01   user      0
116     106   76201          Fix Outside Wires  2015-07-15   user      0

In [59]:
calls.columns = ['site_id', 'account_id', 'call', 'date', 'source', 'churn']
calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26979 entries, 7 to 501549
Data columns (total 6 columns):
site_id       26979 non-null object
account_id    26979 non-null object
call          26979 non-null object
date          26979 non-null object
source        26979 non-null object
churn         26979 non-null int64
dtypes: int64(1), object(5)
memory usage: 1.4+ MB

In [60]:
calls.to_csv("calls.csv")

In [61]:
transaction = events[events.action.apply(lambda x : True if 'transaction_change' in str(x) else False)]
transaction = transaction.drop('event', axis=1)
transaction.action = transaction.action.apply(lambda x : str(str(x).split(':')[1:]))
transaction.head()

,site_id,account,action,date,source,details,churn
501550,150,3302,"['P', '-', 'medium']",2015-08-06,system,casual change: 0.175,1
501551,106,22403,"['P', '+', 'high']",2014-12-26,system,casual change: 1.0,1
501552,106,22403,"['P', '-', 'low']",2015-02-26,system,casual change: 0.120559313363,1
501553,106,22403,"['P', '-', 'medium']",2015-03-26,system,casual change: 0.476118148914,1
501554,106,22403,"['P', '-', 'low']",2015-04-27,system,casual change: 0.03306396891,1

In [67]:
tr_type = transaction.action.apply(lambda x: str(x).split(',')[0].strip(" '["))
sign = transaction.action.apply(lambda x: str(x).split(',')[1].strip(" '"))
level = transaction.action.apply(lambda x: str(x).split(',')[2].strip(" ']"))
tr_type.head()

501550    P
501551    P
501552    P
501553    P
501554    P
Name: action, dtype: object

In [70]:
change = transaction.details.apply(lambda x: str(x).split(':')[0].strip(" "))
change_num = transaction.details.apply(lambda x: str(x).split(':')[1].strip(" "))
change.value_counts()

casual change    149184
Name: details, dtype: int64

In [71]:
transaction.insert(2, 'transaction_type', tr_type)
transaction.insert(3, 'sign', sign)
transaction.insert(4, 'level', level)
transaction.insert(5, 'casual_change', change_num)
transaction.drop(['action', 'details', 'churn'], axis=1, inplace=True)
transaction.head()

,site_id,account,transaction_type,sign,level,casual_change,date,source
501550,150,3302,P,-,medium,0.175,2015-08-06,system
501551,106,22403,P,+,high,1.0,2014-12-26,system
501552,106,22403,P,-,low,0.120559313363,2015-02-26,system
501553,106,22403,P,-,medium,0.476118148914,2015-03-26,system
501554,106,22403,P,-,low,0.03306396891,2015-04-27,system

In [74]:
def convert_type(x):
    res = "unknown"
    
    if x == 'U':
        res = "usage"
    elif x == 'R':
        res = "recurring"
    elif x == 'Q':
        res = "prorates"
    elif x == 'P':
        res = "payments"
    
    return res

In [75]:
transaction.transaction_type = transaction.transaction_type.apply(convert_type)
transaction.transaction_type.value_counts()

payments     74322
recurring    57300
prorates     13826
usage         3736
Name: transaction_type, dtype: int64

In [78]:
transaction = transaction.rename(columns={"account" : "account_id"})
transaction.head()

,site_id,account_id,transaction_type,sign,level,casual_change,date,source
501550,150,3302,payments,-,medium,0.175,2015-08-06,system
501551,106,22403,payments,+,high,1.0,2014-12-26,system
501552,106,22403,payments,-,low,0.120559313363,2015-02-26,system
501553,106,22403,payments,-,medium,0.476118148914,2015-03-26,system
501554,106,22403,payments,-,low,0.03306396891,2015-04-27,system

In [79]:
transaction.to_csv("transaction_change.csv")

In [80]:
peaks = events[events.action.apply(lambda x : True if 'peak' in str(x) else False)]
peaks = peaks.drop('event', axis=1)
peaks.action = peaks.action.apply(lambda x : str(str(x).split(':')[1:]))
peaks.action.value_counts()

['R', '+']    6826
['P', '+']    5691
['R', '-']    2975
['P', '-']    2392
['U', '+']     495
['Q', '+']     384
['Q', '-']     165
['U', '-']     107
Name: action, dtype: int64

In [82]:
peak_type = peaks.action.apply(lambda x: str(x).split(',')[0].strip(" '["))
peak_sign = peaks.action.apply(lambda x: str(x).split(',')[1].strip(" ']"))
peak_num = peaks.details.apply(lambda x: str(x).split(':')[1].strip(" "))
peak_type.value_counts()

R    9801
P    8083
U     602
Q     549
Name: action, dtype: int64

In [83]:
peaks.head()

,site_id,account,action,date,source,details,churn
11,106,22403,"['P', '+']",2015-01-14,system,Abrupt change: 351.86,0
12,106,22403,"['P', '-']",2015-04-27,system,Abrupt change: 156.75,0
13,106,22403,"['P', '+']",2015-08-26,system,Abrupt change: 174.29,0
14,106,22403,"['R', '-']",2015-03-09,system,Abrupt change: 144.92,0
15,106,22403,"['R', '-']",2015-07-09,system,Abrupt change: 158.15,0

In [84]:
peaks.churn.value_counts()

0    19035
Name: churn, dtype: int64

In [85]:
peaks.insert(2, 'peak_type', peak_type)
peaks.insert(3, 'sign', peak_sign)
peaks.insert(4, 'abrupt_change', peak_num)
peaks.drop(['action', 'details', 'churn'], axis=1, inplace=True)
peaks.head()

   site_id account peak_type sign abrupt_change        date  source
11     106   22403         P    +        351.86  2015-01-14  system
12     106   22403         P    -        156.75  2015-04-27  system
13     106   22403         P    +        174.29  2015-08-26  system
14     106   22403         R    -        144.92  2015-03-09  system
15     106   22403         R    -        158.15  2015-07-09  system

In [87]:
peaks.peak_type = peaks.peak_type.apply(convert_type)
peaks.peak_type.value_counts()

recurring    9801
payments     8083
usage         602
prorates      549
Name: peak_type, dtype: int64

In [88]:
peaks = peaks.rename(columns={"account" : "account_id"})
peaks.to_csv("peak_changes.csv")

In [89]:
one_time = events[events.action.apply(lambda x : True if 'onetime_charge' in str(x) else False)]
one_time = one_time.drop('event', axis=1)
change_num = one_time.details.apply(lambda x: str(x).split(':')[1].strip())
one_time.insert(2, 'one_time_charge', change_num)
one_time.drop(['action', 'details'], axis=1, inplace=True)
one_time.head()

    site_id account one_time_charge        date  source  churn
17      106   22403             0.0  2014-12-31  system      0
18      106   22403             0.0  2015-01-13  system      0
19      106   22403             0.0  2015-08-02  system      0
20      106   22403            30.0  2015-09-02  system      0
121     106   79002             0.0  2015-08-25  system      0

In [92]:
one_time.drop('churn', axis=1, inplace=True)

ValueError: labels ['churn'] not contained in axis

In [94]:
one_time = one_time.rename(columns={"account" : "account_id"})
one_time.to_csv("one_time_charge.csv")

In [96]:
rate_changes = events[events.action.apply(lambda x : True if 'rate_changes' in str(x) else False)]
rate_changes = rate_changes.drop(['event', 'action'], axis=1)
change_from = rate_changes.details.apply(lambda x: str(x).split(' ')[3].strip())
change_to   = rate_changes.details.apply(lambda x: str(x).split(' ')[5].strip())
service = rate_changes.details.apply(lambda x: str(x).split(' ')[-1].strip())
change_to.value_counts()

65.0     4366
0.0      2347
10.0     1217
3.5      1012
45.0      858
3.25      697
22.99     564
5.0       542
4.95      536
49.82     499
15.0      458
24.99     403
9.0       352
16.0      347
48.0      272
56.0      239
4.99      231
60.0      210
52.0      200
7.0       174
18.0      172
20.0      164
9.99      158
24.97     157
50.95     157
14.99     157
6.99      153
13.0      153
25.47     137
10.19     137
         ...
95.0        2
58.95       2
33.99       2
16.99       2
27.5        1
-10.0       1
18.66       1
9.16        1
64.0        1
35.0        1
64.31       1
3.31        1
51.57       1
42.7        1
23.81       1
7.39        1
44.0        1
35.55       1
61.0        1
7.5         1
33.33       1
38.0        1
14.95       1
78.0        1
22.86       1
6.5         1
34.24       1
53.0        1
33.95       1
91.0        1
Name: details, dtype: int64

In [98]:
rate_changes.insert(2, 'from_rate', change_from)
rate_changes.insert(3, 'to_rate', change_to)
rate_changes.insert(4, 'service', service)
rate_changes.head()

,site_id,account,from_rate,to_rate,service,date,source,details,churn
8,106,22403,9.0,10.0,328,2015-01-13,system,Rate change from 9.0 to 10.0 service: 328,0
9,106,22403,52.0,56.0,30480,2015-01-13,system,Rate change from 52.0 to 56.0 service: 30480,0
10,106,22403,56.0,65.0,SP05000,2015-01-13,system,Rate change from 56.0 to 65.0 service: SP05000,0
117,106,79002,41.0,65.0,HSDBASE,2015-07-04,system,Rate change from 41.0 to 65.0 service: HSDBASE,0
175,150,131515,0.0,79.95,30433,2014-09-22,system,Rate change from 0.0 to 79.95 service: 30433,0

In [100]:
rate_changes.drop(['details', 'churn'], axis=1, inplace=True)
rate_changes = rate_changes.rename(columns={"account" : "account_id"})
rate_changes.to_csv("rate_changes.csv")
rate_changes.head()

    site_id account_id from_rate to_rate  service        date  source
8       106      22403       9.0    10.0      328  2015-01-13  system
9       106      22403      52.0    56.0    30480  2015-01-13  system
10      106      22403      56.0    65.0  SP05000  2015-01-13  system
117     106      79002      41.0    65.0  HSDBASE  2015-07-04  system
175     150     131515       0.0   79.95    30433  2014-09-22  system

In [101]:
orders.churn.value_counts()

0    234025
Name: churn, dtype: int64

In [102]:
promos.churn.value_counts()

0    90305
Name: churn, dtype: int64

In [103]:
calls.churn.value_counts()

0    26979
Name: churn, dtype: int64

In [104]:
orders.drop('churn', axis=1, inplace=True)
promos.drop('churn', axis=1, inplace=True)
calls.drop('churn', axis=1, inplace=True)

orders.to_csv("orders.csv")
promos.to_csv("promos.csv")
calls.to_csv("calls.csv")

C:\Users\yuranich\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
C:\Users\yuranich\Anaconda2\lib\site-packages\ipykernel\__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()